# Вивесли максимальне число послідовності
numeric = int(input())  # Окремо зчитуємо перше число ДО циклу
maxNum = numeric  # Якому числу = максимум? Якщо введено 1 число, то йому й =
while numeric != 0:  # Поки чергове число не дорівнює 0
    numeric = int(input())  # Зчитуємо чергове число
    if numeric != 0 and numeric > maxNum:  # Якщо чергове число !=0 та більше попереднього максимального
        maxNum = numeric  # То замінимо в якості максимального чергове число
print(maxNum)  # Поза циклом надрукувати той максимум, що ми знайшли
