# Процентная ставка по вкладу составляет P процентов годовых,
# которые прибавляются к сумме вклада через год . Вклад составляет
# x гривен y копеек. Определите размер вклада через k лет.
p = int(input())  # відсоток по депозитах в рік
x = int(input())  # баланс депозиту в грн
y = int(input())  # баланс по депозиту в коп
k = int(input())
i=1
bal = x * 100 + y  # переводимо баланс у копійки
s = (bal + bal * p * 10**-2)    # сума на кінець року в копійках;
kop = int(s)    # відкидаємо від суми в копійках дрібну частину
hrn = int(kop / 100)    # переводимо в грн
while k != i:
    hrn += (hrn * p * 10 ** -2)
    i += 1
# hrn99 = hrn + hrn * p * 10 ** -2
print(hrn)
# print(hrn, kop % 100)   # друге знач-ня - дві ост. цифри числа - і є копійки