# Знайти другу літеру "f" в рядку
n = str(input())
f = n.find('f') # Знаходимо індекс (місце розташ-ня) 1ї 'f'
f2 = n[f+1::]   # робимо зріз рядку; рядок що створиться почнеться від 1ї 'f'
f2find = f2.find('f')   # Знаходимо інд. 2ї'f' в новоствореному рядку
if f == -1:  # Якщо у введеному рядку немає жодної 'f', то виводимо:
    print(-2)
# Як зрозуміти, що в рядку лише 1а'f' ?
elif f2find == -1:  # Почнемо пошук в новоствореному після 1ї 'f' рядку!
    print(-1)
else:   # Місце розташування (індекс) 2ї 'f':
    print(f+f2find+1)   # Індекс першої 'f' + індекс 2ї + 1 (бо злічення обох 'f' поч. з 0 )
