# Видалення фрагментів
s = str(input())
h = s.find('h')     # Знаходимо індекс першої "h";
s999 = s[::-1]      # Перевертаємо слово (напр.: Hello --> olleH)
h999 = s999.find('h')   # Знаходимо індекс першої "h" в перевернутому рядку
s000 = s999[0:h999]     # Відобразимо літери до першої "h" в переверн. рядку
# s[0:h] - відобразити літери в рядку до першої "h"
# s000[::-1] - відображені вище ^^ літери перевернутого рядка перевернемо до
# початкового розміщення, яке було задано в s = str(input())
print(s[0:h]+s000[::-1])  # склеїмо відображені в п.7 і п.8 рядки
